# Pandas
       Data Analysis Libarary
       Series     Single Dimension
       DataFrame  Multi Dimension

In [64]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [4]:
s1.index = ['one','two','three','four','five']

In [5]:
s1

one      1
two      2
three    3
four     4
five     5
dtype: int64

In [6]:
s2 = pd.Series(range(10))
s2

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [7]:
s2.index = ['zero','one','two','three','four','five','six','seven','eight','nine']
s2

zero     0
one      1
two      2
three    3
four     4
five     5
six      6
seven    7
eight    8
nine     9
dtype: int64

In [8]:
s1 + s2

eight     NaN
five     10.0
four      8.0
nine      NaN
one       2.0
seven     NaN
six       NaN
three     6.0
two       4.0
zero      NaN
dtype: float64

In [9]:
s3 = pd.Series([10,20,30], index=['Apple','Mango','Banana'])
s3

Apple     10
Mango     20
Banana    30
dtype: int64

In [10]:
s1 + s3

Apple    NaN
Banana   NaN
Mango    NaN
five     NaN
four     NaN
one      NaN
three    NaN
two      NaN
dtype: float64

In [11]:
s2['three':'eight']

three    3
four     4
five     5
six      6
seven    7
eight    8
dtype: int64

# Lambda Function

In [15]:
s2 = s2.apply(lambda x: x*10)

In [18]:
s2.apply(lambda x: "True" if x > 40 else "Fasle")

zero     Fasle
one      Fasle
two      Fasle
three    Fasle
four     Fasle
five      True
six       True
seven     True
eight     True
nine      True
dtype: object

In [29]:
pd.Series(range(10), index=s2.index)
s4

zero     0
one      1
two      2
three    3
four     4
five     5
six      6
seven    7
eight    8
nine     9
dtype: int64

In [72]:
np.random.seed(25)
pd.Series(np.random.randn(10))

0    0.228273
1    1.026890
2   -0.839585
3   -0.591182
4   -0.956888
5   -0.222326
6   -0.619915
7    1.837905
8   -2.053231
9    0.868583
dtype: float64

In [93]:
s5 = pd.Series((2,4,6,7,9,0,0,65,345,242,65,453,42,np.NaN))

In [78]:
s4 = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5,'f':6,'g':8})

In [84]:
s4.shape

(7,)

In [98]:
s5.tail(4)
s5.take([3,6,8])

3      7.0
6      0.0
8    345.0
dtype: float64

In [109]:
s5

0       2.0
1       4.0
2       6.0
3       7.0
4       9.0
5       0.0
6       0.0
7      65.0
8     345.0
9     242.0
10     65.0
11    453.0
12     42.0
13      NaN
dtype: float64

In [122]:
s6 = pd.Series({'a': 1,'b':2,'c':3,'d':4})
s7 = pd.Series({'b':1,'c':2,'d':3,'e':4})

In [123]:
s6 + s7

a    NaN
b    3.0
c    5.0
d    7.0
e    NaN
dtype: float64

In [124]:
s = pd.Series(range(10))

In [126]:
s[s > 5]

6    6
7    7
8    8
9    9
dtype: int64

In [135]:
np.random.seed(25)
s1 = pd.Series(np.random.randn(5))
s2 = pd.Series(np.random.randn(5))

In [151]:
combined = pd.concat((s1,s2))
combined

0    0.228273
1    1.026890
2   -0.839585
3   -0.591182
4   -0.956888
0   -0.222326
1   -0.619915
2    1.837905
3   -2.053231
4    0.868583
dtype: float64

In [150]:
combined.reset_index(drop=True,inplace=True)
combined

0    0.228273
1    1.026890
2   -0.839585
3   -0.591182
4   -0.956888
5   -0.222326
6   -0.619915
7    1.837905
8   -2.053231
9    0.868583
dtype: float64

In [154]:
np.random.seed(2)
s1 = pd.Series(np.random.randn(4),['a','b','c','d'])
s1

a   -0.416758
b   -0.056267
c   -2.136196
d    1.640271
dtype: float64

In [156]:
s2 = s1.reindex(['a','b','g'])
s2

a   -0.416758
b   -0.056267
g         NaN
dtype: float64

In [161]:
s = pd.Series(np.arange(100,110), index= np.arange(10,20))
s

10    100
11    101
12    102
13    103
14    104
15    105
16    106
17    107
18    108
19    109
dtype: int32

In [172]:
s[-3:]

17    107
18    108
19    109
dtype: int32

# Pandas DataFrame

In [2]:
Student = {'Roll no':[1,2,3,4,5,6,7,8,9],
          'Name': ['Alameen','Sameer','Hammad','Bilal','Ali','Muavia','Ypusf','Arif','Saleem'],
          'Subject': ['Python','Numpy','Pandas','Matplotlib','Seaborn','Tensorflow','Apachli','Python','Numpy'],
          'Mode': ['Online','Online','Onsite','Online','Onsite','Onsite','Online','Onsite','Online']}

In [9]:
df = pd.DataFrame(Student)
df

   Roll no     Name     Subject    Mode
0        1  Alameen      Python  Online
1        2   Sameer       Numpy  Online
2        3   Hammad      Pandas  Onsite
3        4    Bilal  Matplotlib  Online
4        5      Ali     Seaborn  Onsite
5        6   Muavia  Tensorflow  Onsite
6        7    Ypusf     Apachli  Online
7        8     Arif      Python  Onsite
8        9   Saleem       Numpy  Online

In [11]:
type(df['Roll no'])

pandas.core.series.Series

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df['Country'] = "Pakistan"
df

   Roll no     Name     Subject    Mode   Country
0        1  Alameen      Python  Online  Pakistan
1        2   Sameer       Numpy  Online  Pakistan
2        3   Hammad      Pandas  Onsite  Pakistan
3        4    Bilal  Matplotlib  Online  Pakistan
4        5      Ali     Seaborn  Onsite  Pakistan
5        6   Muavia  Tensorflow  Onsite  Pakistan
6        7    Ypusf     Apachli  Online  Pakistan
7        8     Arif      Python  Onsite  Pakistan
8        9   Saleem       Numpy  Online  Pakistan

In [15]:
df['Ages'] = [23,22,20,23,42,45,12,43,12]
df

   Roll no     Name     Subject    Mode   Country  Ages
0        1  Alameen      Python  Online  Pakistan    23
1        2   Sameer       Numpy  Online  Pakistan    22
2        3   Hammad      Pandas  Onsite  Pakistan    20
3        4    Bilal  Matplotlib  Online  Pakistan    23
4        5      Ali     Seaborn  Onsite  Pakistan    42
5        6   Muavia  Tensorflow  Onsite  Pakistan    45
6        7    Ypusf     Apachli  Online  Pakistan    12
7        8     Arif      Python  Onsite  Pakistan    43
8        9   Saleem       Numpy  Online  Pakistan    12

In [17]:
# list comprehension method
df['Status'] = ['Pass' if x > 22 else 'Fail' for x in df['Ages']]
df

   Roll no     Name     Subject    Mode   Country  Ages Status
0        1  Alameen      Python  Online  Pakistan    23   Pass
1        2   Sameer       Numpy  Online  Pakistan    22   Fail
2        3   Hammad      Pandas  Onsite  Pakistan    20   Fail
3        4    Bilal  Matplotlib  Online  Pakistan    23   Pass
4        5      Ali     Seaborn  Onsite  Pakistan    42   Pass
5        6   Muavia  Tensorflow  Onsite  Pakistan    45   Pass
6        7    Ypusf     Apachli  Online  Pakistan    12   Fail
7        8     Arif      Python  Onsite  Pakistan    43   Pass
8        9   Saleem       Numpy  Online  Pakistan    12   Fail

In [21]:
df['City'] = df.Mode.apply(lambda x: 'OutOfKhi' if x == 'Online' else 'Karachi')
df

   Roll no     Name     Subject    Mode   Country  Ages Status      City
0        1  Alameen      Python  Online  Pakistan    23   Pass  OutOfKhi
1        2   Sameer       Numpy  Online  Pakistan    22   Fail  OutOfKhi
2        3   Hammad      Pandas  Onsite  Pakistan    20   Fail   Karachi
3        4    Bilal  Matplotlib  Online  Pakistan    23   Pass  OutOfKhi
4        5      Ali     Seaborn  Onsite  Pakistan    42   Pass   Karachi
5        6   Muavia  Tensorflow  Onsite  Pakistan    45   Pass   Karachi
6        7    Ypusf     Apachli  Online  Pakistan    12   Fail  OutOfKhi
7        8     Arif      Python  Onsite  Pakistan    43   Pass   Karachi
8        9   Saleem       Numpy  Online  Pakistan    12   Fail  OutOfKhi

In [22]:
dic = {'Alameen' : 20,'Sameer': 21,'Ali':32,'Arif':12,'Saleem':30,'Hammad':23,'Bilal': 29,'Ypusf': 14,'Muavia': 32}

In [26]:
df['NewAges'] = df.Name.map(dic)
df

,Roll no,Name,Subject,Mode,Country,Ages,Status,City,NewAges
0,1,Alameen,Python,Online,Pakistan,23,Pass,OutOfKhi,20
1,2,Sameer,Numpy,Online,Pakistan,22,Fail,OutOfKhi,21
2,3,Hammad,Pandas,Onsite,Pakistan,20,Fail,Karachi,23
3,4,Bilal,Matplotlib,Online,Pakistan,23,Pass,OutOfKhi,29
4,5,Ali,Seaborn,Onsite,Pakistan,42,Pass,Karachi,32
5,6,Muavia,Tensorflow,Onsite,Pakistan,45,Pass,Karachi,32
6,7,Ypusf,Apachli,Online,Pakistan,12,Fail,OutOfKhi,14
7,8,Arif,Python,Onsite,Pakistan,43,Pass,Karachi,12
8,9,Saleem,Numpy,Online,Pakistan,12,Fail,OutOfKhi,30